<?php

namespace System;

class StringHandler {
    
    const REGEX_TIME = '^([0-9]|0[0-9]|1[0-9]|2[0-3]):[0-5][0-9]:[0-5][0-9]$';
    const REGEX_EMAIL = '^[\w-\.]+@[\w.-]+\.[A-Za-z]{2,64}$';
    const REGEX_ENCHARS_AND_NUMBERS = '^[\w ]+$';
    const REGEX_HUCHARS_AND_NUMBERS = '^[\wáéíóöőúüűÁÉÍÓÖŐÚÜŰ ]+$';
    const REGEX_ENCHARS_AND_PUNCTUATIONS = '^[\w ,\.-?:;&@\(\)\[\]\{\}=\'~\"+!%\/*]+$';
    const REGEX_HUCHARS_AND_PUNCTUATIONS = '^[\wáéíóöőúüűÁÉÍÓÖŐÚÜŰ ,.-?:;&@\(\)\[\]\{\}=\'~\"+!%\/*]+$';
    const REGEX_DB_DATE = '^(?:(?:31-(?:0[13578]|1[02]))-|(?:(?:29|30)-(?:0[1,3-9]|1[0-2])-))(?:(?:1[6-9]|[2-9]\d)\d{2})$|^(?:29-02-(?:(?:(?:1[6-9]|[2-9]\d)(?:0[48]|[2468][048]|[13579][26])|(?:(?:16|[2468][048]|[3579][26])00))))$|^(?:0[1-9]|1\d|2[0-8])-(?:(?:0[1-9])|(?:1[0-2]))-(?:(?:1[6-9]|[2-9]\d)\d{2})$';
    const REGEX_DATE = '^(?:(?:31(\/|-|\.)(?:0?[13578]|1[02]|(?:Jan|Mar|May|Jul|Aug|Oct|Dec)))\1|(?:(?:29|30)(\/|-|\.)(?:0?[1,3-9]|1[0-2]|(?:Jan|Mar|Apr|May|Jun|Jul|Aug|Sep|Oct|Nov|Dec))\2))(?:(?:1[6-9]|[2-9]\d)?\d{2})$|^(?:29(\/|-|\.)(?:0?2|(?:Feb))\3(?:(?:(?:1[6-9]|[2-9]\d)?(?:0[48]|[2468][048]|[13579][26])|(?:(?:16|[2468][048]|[3579][26])00))))$|^(?:0?[1-9]|1\d|2[0-8])(\/|-|\.)(?:(?:0?[1-9]|(?:Jan|Feb|Mar|Apr|May|Jun|Jul|Aug|Sep))|(?:1[0-2]|(?:Oct|Nov|Dec)))\4(?:(?:1[6-9]|[2-9]\d)?\d{2})$';
    const REGEX_NUMBER = '^[0-9]+$';
    const REGEX_NUMBER_AND_POINT = '^[0-9\.]+$';
}
